let col1H = 0;
let col2H = 0;
const App = getApp();

Page({

  data: {
    scrollH: 0,
    imgWidth: 0,
    loadingCount: 0,
    images: [],
    col1: [],
    col2: [],
    dis:false,
    disImg:'',
    disHeight:'400rpx',
    title:'世界名画',
    page:1,
    name: ["无名女郎-克拉姆斯柯依", "入睡的维纳斯-乔尔乔内", "蒙娜丽莎-达芬奇", "梦-毕加索", "日出印象-莫奈", "舞蹈教室-德加","黄金岁月-巴尔蒂斯","吹笛少年-马奈","向日葵-凡高","劳动归来-米勒","春光-考特","吻-克里姆特","红磨坊舞会-雷诺阿","松树林之晨-希施金","画家母亲肖像-惠斯勒","土耳其浴室-安格尔","意外归来-列宾","缠毛线-莱顿","里姆斯基夫人-温特哈尔特","森林之神与仙女们-布格罗","德·蓬帕杜尔夫人 -布歇","玩牌者-塞尚","舞蹈-马蒂斯","托尔斯泰肖像-列宾","暴风雨-乔尔乔内","我们从哪里来-高更","根特祭坛画-艾克兄弟","画室-库尔贝","自由引导人民-德拉克罗瓦","拾穗-米勒","克里斯蒂娜的世界-怀斯","干草车-康斯太勃尔","创造亚当-米开郎基罗","梅杜萨之筏-席里柯","激吻-海耶兹","带珍珠耳环的少女-维米尔","麦田与收割者-凡高","舟发西苔岛-华托","杜普教授的解剖课-伦勃郎","乌尔比诺的维纳斯-提香","陶醉-莱顿","蓝衣少年-庚斯博罗","秋千-弗拉戈纳尔","抑郁的少女-里皮金","西斯廷圣母-拉斐尔","家-马科夫斯基","呐喊-蒙克","尼德兰箴言-勃鲁盖尔","大碗岛星期日-修拉","足球运动员-卢梭","蓝裙子-史蒂文斯","金色的秋天-列维坦","生命的舞蹈-蒙克","记忆的永恒-达利","下楼梯的裸女-杜尚","1948年5号作品-波洛克","黄·红·蓝 -康定斯","阿拉伯姑娘-朗代尔","马拉之死-大卫","埃斯特雷姐妹-未知","画家与女儿像-维瑞","吉卜寨女郎-哈尔斯","窗边阅读的女人-恩霍拉斯","珍珠女郎-柯罗","雾海上漫游者-弗里德里希","人生第一步-凡高","月夜-克拉姆斯柯依","搁浅-透纳","白桦林-库茵芝","舞蹈课-德加","肯特海滩-居丹","第聂伯河上的月夜-库因芝","伏尔加纤夫-列宾","巴迪侬画室-拉图尔","海伦娜肖像-鲁本斯","国王的悲伤-马蒂斯","左拉肖像-马奈","苏姗娜出浴-丁托列","诸神的盛宴-乔凡尼","玛古拉达的玛丽-佩鲁基诺","不相称的婚姻-普基寥夫","阿尔诺芬尼夫妇像-凡艾克","比较-塔得玛","日落-莫奈","伞-雷诺阿","披纱巾的少女-拉斐尔","夜巡-伦勃郎","萨宾女人-大卫","枪杀起义者-戈雅","安德烈·鲁韦尔像 -马尔凯","巴比松草原的牧羊女-米勒","阅读-莱顿","雷卡米埃夫人-热拉尔","农民之家-勒南","阿卡迪亚的牧人-普桑","泉-安格尔","泉-杜尚","歌德在罗马平原-蒂施拜因","路遇-库尔贝","海边少女-夏凡纳","抱貂女郎-达芬奇","莫第西埃夫人-安格尔","夜间咖啡馆-凡高","田园合奏-乔尔乔内","夏庞蒂埃太太像-雷诺阿","拿烟斗男孩-毕加索","布道后的幻象-高更","生活的欢乐-马蒂斯","聊天-布拉斯","波浪-布格罗","织花边的姑娘-维米尔","情书-维米尔","炮声-费尔德","诗人的灵感-普桑","年轻的女孩与花束-卓别林","乌菲齐美术馆收藏-左法尼","丁香花束-蒂索","休息-列宾","娜娜-马奈","梳妆的妇人-提香","法庭上的芙丽涅-热罗姆","破壶-格瑞兹","暴风雨-考特","真理-勒菲弗尔","许拉斯和水仙-沃特豪斯","芙林达-温特哈尔特","浴中的苏珊娜-埃内","三等车厢-杜米埃","贝尔登肖像-安格尔","阿尔及利亚下午-布里奇曼","波赛尔夫人肖像-戈雅","加纳的婚礼-委罗内塞","镜前的维纳斯-委拉斯贵支","小丑-华托","九级浪-艾伊瓦佐夫斯基","林妖的舞蹈-柯罗","夏-普桑","雅典学院-拉斐尔","自画像-丢勒","收割-勃鲁盖尔","无畏号战舰-透纳","凭窗的亨德丽娅-伦勃郎","倒牛奶的女佣-维米尔","剧院包厢-雷诺阿","包厢-弗里思","仲夏夜-蒙克","春-普拉斯托夫","加歇医生像-凡高","星月夜-凡高","教皇英诺森像-委拉斯贵支","荷拉斯兄第的宣誓-大卫","蒙特枫丹的回忆-柯罗","着衣的玛哈-戈雅","裸体的玛哈-戈雅","给土耳其苏丹回信-列宾","慈禧肖像-卡尔","但丁的小舟-拉克洛","抹大拉的忏悔-巴托尼","微风下的荷兰小船-卡帕勒","庞贝末日-布留洛夫","即兴31号-康定斯基","红白蓝的菱形画-蒙德里安","亚威农少女-毕加索","死与火-克利","螺旋形的防波堤-史密森","查理一世打猎像-凡代克","女占卜师-卡拉瓦乔","圣母报喜-巴托尼","伊拉斯谟像-小荷尔拜因","晚钟-米勒","读书少女-弗拉戈纳尔","林荫道-霍贝玛","阿尔卑斯山雪崩-卢泰尔堡","贩卖孩子的商人-维安","盲女-密莱","笛子演奏会-门采尔","桌球-布瓦伊","女士肖像-佩鲁其诺","绿垫圣母子-索拉里","法兰西斯一世-克卢埃","伊丽莎白像-克卢埃","沐浴的希腊贵妇人-维安","微笑的军官-哈尔斯","雪中猎人-勃鲁盖尔","最后的晚餐-包茨","时髦婚姻·早餐 -荷加斯","暴风雪中的汽船-透纳","韦克的风车-雷斯达尔","惊马-斯塔布斯","在公园里-莫里索","恋人的花冠-弗拉戈纳尔","集体发明物-马格利","意大利早晨-布留洛夫","意大利晌午-布留洛夫","两姐妹-夏塞里奥","美惠三女神-拉斐尔","相思-格维得","埃拉加巴卢斯玫瑰-塔德玛","克娄巴特拉尝毒-卡巴内尔","少女克洛伊-勒菲弗尔","饭前祈祷-夏尔丹","维苏威火山爆发-勒发","阿廖努什卡-瓦斯涅佐夫","洗澡-卡萨特","普希金像-吉普林斯基","狂暴海涛-艾伊瓦佐夫斯基","白嘴鸦飞来了-萨符拉索夫","在遥远的北方-希施金","到处是生活-雅罗申柯","骑灰狼的王子-瓦斯涅佐夫","吉尔斯曼娜像-谢洛夫","费来福磨坊-康斯太勃尔","麦田-温特","黄金时代-本杰明","科内亚-黑特希","牧羊女-米勒","正义与和平的寓意-贾昆托","斜卧的女人-席勒","主妇与女仆-霍赫","在音乐与绘画之间-考夫曼","红磨坊舞会-劳特累克","神日-高更","沃伦夫人和女儿-萨金特","全家团聚-巴齐耶","海滩上的四个人体-古图索","站在窗后的男人-卡耶博特","站在窗边女孩-达利","奥林匹亚-马奈","红色中和谐-马蒂斯","撑洋伞的女人-莫奈","手持茶罐村姑-阿尔希波夫","静物苹果篮子-塞尚","拿破仑越圣贝尔纳山-大卫","自画像-伦勃朗","仕女乔凡娜别尼-吉郎达约","灰与绿的和谐-惠斯勒","有中国人物的风景-布歇","宫娥-委拉斯贵支","乔治基茨像-小荷尔拜因","苦艾酒-德加","小淘气-布格罗","布罗格利公主-安格尔","阳伞-戈雅","有阳台的房间-门采尔","帕里斯的评判-洛兰","达那厄-伦勃朗","拾麦穗的女人-莱尔米特","挤奶妇-杜普荷","小憩-雷纳多","收牧草的农妇-杜普荷","收获的十月-哈格伯格","第二次收获-杜普荷","圣佩尔山割麦人-莱尔米特","人生三阶段-西蒙","扭打-布格罗","王子回来了-科尔托纳","公主的肖像-温特哈尔特","手套作坊-圣坦","瓦莱里娅-沃特勒","德尔夫特风景-维米尔","西班牙舞女-博尔迪尼","收割麦子-本顿","亲爱的鸟儿-布格罗","霍顿丝皇后肖像-特里奥松","戴安娜和丘比特-巴托尼","一个圣女-塞耶","达娜厄和黄金雨-沃特穆勒","母爱-朱丹","塞勒涅-奥伯利特","小帆船-林奇","维纳斯的诞生-卡巴内尔","梦-卡巴诺夫","小园丁-吉普林斯基","蓝绿色的蓬巴杜夫人-布歇","牧羊女-勒努瓦","在橘园-佩鲁吉尼","采摘啤酒花-佩鲁吉尼","井边的加百利-普桑","亲切的闲聊-布拉斯","手捧豌豆花的姑娘-波因特","三美神-勒尼奥","第一执政官拿破仑-安格尔","苏珊娜洗浴-默尔","希腊人在玩斗鸡-热罗姆","裸女和狗-库尔贝","五感觉-马卡特","约瑟和波第的妻子-纳蒂埃","梦神和彩虹女神-盖兰","平衡星座仙子-里卡多","年轻女子作画-薇乐思","摔跤-弗里恩特","波浪和珍珠-博德里","布雷恩和他的战利品-雅明","一个年轻女子的肖像-库特","林边的花-希施金","布莱欣伯爵夫人-劳伦斯","灰姑娘-普林西普","赞赏-布格罗","风暴山洞里的宁芙-波因特","平克弗洛伊德-德埃尼","随着时间的音乐起舞-普桑","市场归来-夏尔丹","都市活动-本顿","时间之神摧毁美丽-巴托尼","意大利强盗-巴赞","长颈圣母-帕米贾尼","伞下情-阿弗莱莫夫","阳台上的两姐妹-雷诺阿","化妆的埃斯特-沙塞里奥","新娘-杜尚","牧师罗伯特滑冰图-雷本","苏格拉底之死-大卫","女黑人像-贝诺瓦","贝壳-布格罗","阿拉伯少女-法莱罗","草地上的圣母-拉斐尔","沐浴-毕加索","蓬巴杜夫人-布歇","戴帽子的妇人-马蒂斯","采摘罂粟花的女孩-丹尼尔","弹曼陀玲的姑娘-卡拉瓦桥","船上的午餐-雷诺阿","鸢尾花-凡高","忏悔的抹大拉-拉图尔","街头五个女人-凯尔希纳","对镜女孩-洛克威尔","坐着的裸女-毕加索","梦-卢梭","生日-夏加尔","女病人与医生-杨斯丁","熟睡的维纳斯-德尔沃","处女-克林姆特","春情-蒙克","永久的婚约-休斯","塔希提岛的牧歌-高更","乌鸦群飞麦田-凡高","沙滩上奔跑两女人-毕加索","船闸-康斯特布尔","少女和桃子-谢洛夫","春天的小屋-萨符拉索夫","三个女子-莱热","两个小孩-毕加索","被废黜的最爱-柯尔","珍妮女士处决图-德拉罗什","三美神-雷诺兹","手捧鸽子的孩子-毕加索","阿黛尔夫人-克里姆特","弗洛伊德肖像画习作-培根","镜中扭曲的形象-培根","睡莲池-莫奈","女人3号-库宁","珍妮-莫迪里阿尼","祈祷-洛克威尔","裸体绿叶和半身像-毕加索","苹果-塞尚","道拉马拉与猫-毕加索","白色中心-罗斯科","裸体模特-德尔沃","对无辜者的大屠杀-鲁本斯","没胡子的自画像-凡高","静物-塞尚","双臂抱胸的女人-毕加索","坐在花园中的女人-毕加索","读书-毕加索","阿让特伊之铁路桥-莫奈","花瓶与5朵向日葵-凡高","花瓶中15朵向日葵-凡高","胖女裸睡图-弗洛伊德","在草原中央-莫奈","怀孕的情人-毕加索","毛泽东肖像-沃霍尔","清晨-高更","女矿工-卡萨特金","索科尔尼克的秋日-列维坦","情人-怀斯","旋转的肖像-达利","回头浪-霍默","大学生法庭-古图索","审视镜旁模特与咖啡-霍夫","两美人在垂钓-丹尼尔","裸体运动-赫朗","气泵里的鸟实验-赖特","长安街上的自行车流-索恩","巴黎女子肖像-保罗","微笑的蒙娜丽莎-列德蒙可","皇后伊莎贝拉-杜瓦尔","客栈-布洛赫","半裸的女孩-卓别林","埃塞情人变成岩石-皮埃尔","失色的黎明-马什尼科夫","正在穿鞋的姑娘-德拉波","三个女人-谢里","裸背女人-马林诺夫","女子与礼帽-奥尔蒂","废墟上-亚当米勒","海滩的一天-保罗凯","蓬巴杜夫人全身像-拉图尔","冷冷的夏天-马什尼科夫","雨中行-安德烈科恩","花园-阿丽莎","毛泽东在纽约-伊洛","背靠枯树的时髦女郎-霍夫","巴黎圣母院-杜瓦尔","没有中间地带-罗杰斯","奥菲莉娅-卡巴内尔","沉思的少女-赫弗兰","模特与画-丹尼尔夫捷哈兹","搓麻将的女人-刘溢","方块A作弊者-拉图尔","打牌作弊者-卡拉瓦乔","超级女子-福瑞斯特","微笑-布莱尔","吸烟女孩-卢卡斯威兹","海滩上-汉克斯","门闩-弗拉戈纳尔","蜂拥-布格罗","巴黎雨天的街道-古斯塔夫","睡-库尔贝","沃特森和鲨鱼-科普利","女仆-特鲁伊贝尔","有舞者的风景-洛兰","达娜厄-戈沙尔特","玩饼干-弗拉戈纳尔夫","亚当和夏娃-朗毕克","紫色-朗毕克","游泳者-屈居埃尔","鉴赏家-洛克威尔","梦中情人-弗拉戈纳尔","迎春-王沂东","早春-延多古罗夫","排练-哈利","母亲凝视两个孩子-布格罗","自画像-塞莱布里阿库娃","艾琳·马森 -加雷特","仲夏之夜-佐恩","绘画的寓言-维米尔","生命是一条河-玛莎","兹伯里大教堂-康斯太勃尔","阳光下的裸女-斯图尔特","海滩上的人-雷诺阿","沐浴的塔希提女子-高更","奥莫尔菲小姐-布歇","浴女们-塞尚","在斯卡恩的海滩上-安切尔","女骑士-布留洛夫","梳头女子-德加","在和平田野上-梅尔尼科夫","林中浴女-毕沙罗","富士山和花-霍克尼","夜-霍德勒","弗西利亚-古图索","对坐两女子-奥尔蒂斯","四棵树-席勒","等待新天体-卡卢金","诗-鲁西尼奥尔","月光下的诱惑-德尔沃","东方记忆-德格朗尚","格雷厄姆夫人像-庚斯博罗","海边别墅-勃克林罗","云山雾水-阿姆斯特朗","普赛克第一次之吻-热拉尔","石屋门边的人体-玛拉莱特","牛轭湖-科尔","欢迎来到-阿丽莎","在世界边缘上-保罗凯利勒","宁芙的海岸-莱顿","希望-夏凡纳","洗衣妇-夏尔丹","洗衣妇-阿尔希波夫","洗衣妇-米勒","达娜厄-柯雷乔","命运女神与乞丐-马尔科夫","乌克兰的傍晚-库因芝","在克里米亚山上-瓦西里耶","吻-莫勒","红衣男孩-劳伦斯","大浴女-雷诺阿","裸女-帕克斯顿","傍晚消逝的幻觉-格莱尔","蓝衣女子的肖像-科普利","浴缸-佐恩","高山上的阅读-罗伯茨","故乡的田野-霍克尼","克鲁默风景-席勒","眺望大海-谢里登","小孩与布熊-赫弗兰","她在花丛中-丹尼尔夫捷","西部牛仔-雷明顿","煮土豆的老农妇-佐恩","浴后-汉克斯","捉迷藏-史蒂文斯","大水花-霍克尼","和谐-卡卢金","睡觉的孩子-佩罗夫","飞船自动记录仪-乌里宾斯","中国女士-亨瑞","浴前涂粉女郎-加雷特","溜冰者-斯图尔特","夏日海边-德雷珀","林中雨滴-希施金"]
  },

  onLoad: function () {
    wx.getSystemInfo({
      success: (res) => {
        let ww = res.windowWidth;
        let wh = res.windowHeight;
        let imgWidth = ww * 0.48;
        let scrollH = wh;

        this.setData({
          scrollH: scrollH,
          imgWidth: imgWidth
        });
        this.wifiGetP();
      }
    })
  },
  wifiGetP(){
    App.showLoading('加载中');
    wx.getConnectedWifi({
      success: (wifi) => {
        // console.log(1)
        let images = []
        let url = 'http://www.zyzw.com/sjmhxs/sjmhxst/sjmhxst'
        let jpg = '.jpg'
        for (let i = (this.data.page-1)*20+1; i <= this.data.page*20; i++) {
          i += ''
          if (i.length === 1) {
            i = '00' + i;
          } else if (i.length === 2) {
            i = '0' + i;
          }
          images.push({
            pic: url + i + jpg, height: 0,title:this.data.name[i-1]
          })
        }
        this.setData({ images: images });
        this.loadImages();
        // console.log(this.data.images)
      },
      fail: res => {
        // console.log(2)
        let images = [
          { pic: "../../static/image/p1.jpg", height: 0 ,title:'我好怕怕呀!'},
          { pic: "../../static/image/p2.jpg", height: 0,title:'我要跳的更高~' },
          { pic: "../../static/image/p3.jpg", height: 0,title:'卢浮宫你好吗~' },
          { pic: "../../static/image/p4.jpg", height: 0,title:'我们结婚啦~' },
          { pic: "../../static/image/p5.jpg", height: 0,title:'我可爱咩~' },
          { pic: "../../static/image/p6.jpg", height: 0,title:'99朵玫瑰~我爱你~' },
          { pic: "../../static/image/p7.jpg", height: 0 ,title:'218我们领证啦~'},
          { pic: "../../static/image/p8.jpg", height: 0 ,title:'218我们领证啦~'},
          { pic: "../../static/image/p9.jpg", height: 0 ,title:'携子之手,与子偕老'},
          { pic: "../../static/image/p10.jpg", height: 0 ,title:'可爱的两人~'},
          // { pic: "../../static/image/p11.jpg", height: 0,title:'曾经的美好~' },
        ];
        this.setData({ images: images });
        this.loadImages();
      }
    })
  },
  pause(){
    this.setData({dis:false})
  },
  loadImages1(res){
    let  p = this.data.page +1
  this.setData({page:p})
  this.wifiGetP();
  },
  onShareAppMessage: function () {
    return {
      title: 'ChouChouLoveCandy',
      path: '/pages/pic/pic'
    }
  },
  getImg(e){
  this.setData({
    disImg:e.target.dataset.img,
    title: e.target.dataset.title,
    disHeight: e.target.dataset.height*2,
    dis:true
  })
// console.log(e)
  },
  errormiss:function(e){
    let im = this.data.images.filter(item=>{
      return item.id !== e.target.id
    })
    this.setData({
      images:im
    })
    // console.log(this.data.images)
// console.log(e)
  },
  onImageLoad: function (e) {
    // console.log(e.detail.height)
    // if (!e.detail.height){
    //   console.log(12)
    //   return 
    // }
    let imageId = e.currentTarget.id;
    let loadingCount;
    // console.log(imageId)
    if (!imageId){
     loadingCount = this.data.loadingCount - 1;
      return
    }
    let oImgW = e.detail.width;         //图片原始宽度
    let oImgH = e.detail.height;        //图片原始高度
    let imgWidth = this.data.imgWidth;  //图片设置的宽度
    let scale = imgWidth / oImgW;        //比例计算
    let imgHeight = oImgH * scale;      //自适应高度

    let images = this.data.images;
    let imageObj = null;

    for (let i = 0; i < images.length; i++) {
      let img = images[i];

      if (img.id === imageId) {
        imageObj = img;
    imageObj.height = imgHeight;
        break;
      }
    }
    // console.log(imgHeight, imageObj)

    loadingCount = this.data.loadingCount -1;
    let col1 = this.data.col1;
    let col2 = this.data.col2;

    if (col1H <= col2H) {
      col1H += imgHeight;
      col1.push(imageObj);
    } else {
      col2H += imgHeight;
      col2.push(imageObj);
    }

    let data = {
      loadingCount: loadingCount,
      col1: col1,
      col2: col2
    };

    if (!loadingCount) {
      data.images = [];
    }

    this.setData(data);
  },

  loadImages: function () {
    let images = this.data.images;
    let baseId = "img-" + (+new Date());
    for (let i = 0; i < images.length; i++) {
      images[i].id = baseId + "-" + i;
    }
    this.setData({
      loadingCount: images.length,
      images: images
    });
    // console.log(this.data.images)
    // App.hideLoading();

  }

})